In [19]:
import pandas as pd
import numpy as np
from random import randint

In [20]:
df = pd.DataFrame({
    "Name" : [
        "Rohit", 
        "Dash", 
        "Apple", 
        "Ralph", 
        "Jon"], 
    "Score": [randint(0,100) for x in range(0,5)],
    "Age" : [21, 20, 25, 26,23]
})

In [21]:
df

    Name  Score  Age
0  Rohit     46   21
1   Dash     50   20
2  Apple     19   25
3  Ralph     69   26
4    Jon      4   23

In [22]:
df["Score"]

0    46
1    50
2    19
3    69
4     4
Name: Score, dtype: int64

In [23]:
aseries = pd.Series([4,5,6], name= "Panda Series")

In [24]:
aseries

0    4
1    5
2    6
Name: Panda Series, dtype: int64

In [25]:
df["Score"].max()

69

In [26]:
df.describe()

           Score       Age
count   5.000000   5.00000
mean   37.600000  23.00000
std    25.909458   2.54951
min     4.000000  20.00000
25%    19.000000  21.00000
50%    46.000000  23.00000
75%    50.000000  25.00000
max    69.000000  26.00000